# Missing Data
At times you will find no data stored in the variable of observation. This kind of missing data is then referred to as "Missing Data" or "Missing value"

In [1]:
import numpy as np
import pandas as pd

In [2]:

df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,np.nan]})

In [3]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

##### isnull() function
The isnull() function detects missing values and returns a boolean. This boolean indicates whether or not there is a missing value.

In [6]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True   True

In [10]:
pd.isnull(df['A'])

0    False
1    False
2     True
Name: A, dtype: bool

##### notnull() function
The notnull() function works just like the isnull() function. The only difference is that the value of the boolean is given in reverse, meaning that "True" will be returned when there is a value and "False" will be returned when there is a missing value.

In [11]:
df.notnull()

       A      B      C
0   True   True   True
1   True  False   True
2  False  False  False

In [12]:

pd.isnull(df['A'])

0    False
1    False
2     True
Name: A, dtype: bool

#### dropna() function
The dropna() function is used to remove the missing values

In [13]:

df.dropna()

     A    B    C
0  1.0  5.0  1.0

In [14]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

In [15]:
df.dropna(how='all')

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0

##### fillna()  and replace() funcation
The fillna() function fills every missing value with another one.

In [16]:
df.fillna(value='Fil Value')

           A          B          C
0          1          5          1
1          2  Fil Value          2
2  Fil Value  Fil Value  Fil Value

In [17]:
df.fillna(0)

     A    B    C
0  1.0  5.0  1.0
1  2.0  0.0  2.0
2  0.0  0.0  0.0

In [18]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

In [19]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64